<template>
<div>
  <app-header></app-header>
  <router-view></router-view>
  
</div>
</template>

<script>
  // не вижу где здесь используються компоненты search и results
  // у тебя должно в консоли писать об этом
import Content from './Content.vue';
import Header from './Header.vue';
import Search from './Search.vue';
import Results from './Results.vue';

export default {
  components: {
    'app-content': Content,
    'app-header': Header,
    'app-search': Search,
    'app-results': Results,
  },
}

</script>

<style>
  /*
    По поводу стилей
    Ты можешь описывать стили здесь, то есть внутри компонента если стиль принадлежат только ему

    Если стили общие, то есть ты используешь этот класс в разных компонентах - то такие стили можно вынесли в обший
    файл и подключить его либо в app.vue в блоке style без scoped, либо в main.js

    Так будет даже лучше потому что так легче найли локальные стили конкретного файла

    Так же в глобальных стилях проще будет что-то найти

    Вообще есть целые мануалы на счет этого, методологии и патерны
    так что это не такой уж и простой момент)


    Так же нужно форматировать свой код
    Отформатированый код проще читать и ревьюверу и создателю
    Если не знаешь как форматируеться js, css или еще что-то - гугли например: conversation (язык) или (фреймворк)
    Я скину сслыку в чат по поводу этого

    example.txt - тоже не нужно пушить) это как я понимаю какой-то временный файл
  */
</style>
